Repository: mmrm11/48764011D
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: There was little interest in imitating friends’ appearance since their peers also experience body dissatisfaction (Dohnt & Tiggermann, 2006).
es_es: Les interesaba poco imitar el aspecto de sus amigas, ya que sus iguales también experimentaban insatisfacción corporal (Dohnt & Tiggermann, 2006).

source: Therefore, adolescents rely upon their friends in establishing intimate relationships, self-disclosure, and forming true companionships (Auslander, & Dunham, 1996).
es_es: Por lo tanto, los adolescentes confían en sus amigos para establecer relaciones íntimas, revelarse y formar verdaderos compañerismos (Auslander, & Dunham, 1996).

source: Therefore, contingent acting out of game characters’ behavioral traits – mostly aggression and obsession with physical attractiveness – aroused untimely or exaggerated development of sexual identity and negative manifestations of conduct.
es_es: Por lo tanto, la actuación contingente de los rasgos de conducta de los personajes de los juegos, principalmente la agresividad y la obsesión por el atractivo físico, suscita un desarrollo intempestivo o exagerado de la identidad sexual y manifestaciones negativas de la conducta.

source: Therefore, it can be observed that peer influence is the major cause of desired and undesired behaviors, feelings, and principles among youths (Presnell, Bearman, & Madeley, 2007).
es_es: Por lo tanto, se puede observar que la influencia de los iguales es la principal causa de comportamientos, sentimientos y principios deseados y no deseados entre los jóvenes (Presnell, Bearman y Madeley, 2007).

source: Therefore, low self-esteem is caused by unreal standards of physical attractiveness, which is promoted by social culture.
es_es: Por lo tanto, la baja autoestima es causada por unos esándares irreales de la atractividad física, que es promovida por la cultura de la sociedad.

source: Therefore, media resources are the subjects of one of the basic model of observational learning.
es_es: Por lo tanto, las redes sociales son objeto de uno de los modelos básicos del aprendizaje observacional.

source: Therefore, negative remarks on body image from the mother serve to hearten deprived eating habits among girls.
es_es: Por lo tanto, los comentarios negativos sobre la imagen corporal por parte de la madre sirven para reforzar los hábitos alimentarios de privación entre las niñas.

source: Therefore, studies conducted about body image allow us to determine several factors that influence high rates of body dissatisfaction among adolescents.
es_es: Así pues, estudios llevados a cabo acerca de la imagen corporal nos permiten determinar varios factores que influencian a las tasas elevadas de insatisfacción corporal en los adolescentes.

source: Therefore, the body image influences peer relationships largely, as many people would think.
es_es: Por lo tanto, la imagen corporal influye en gran medida en las relaciones entre iguales, como mucha gente podría pensar.

source: Therefore, the desire to belong may put much pressure on an adolescent to maintain a slim body, which might end up affecting the eating practices of an individual.
es_es: Por lo tanto, el deseo de pertenencia puede ejercer mucha presión sobre un adolescente para que mantenga un cuerpo esbelto, lo que podría acabar afectando a las prácticas alimentarias de un individuo.

source: Therefore, the mental health organization initiated research to define the problem and to outline possible solutions to it.
es_es: Por lo tanto, la organización de la salud mental inició una investigación para definir el problema y para delinear posibles soluciones al mismo.

source: Therefore, the present paper will focus on investigating the extent to which various socializing agents such as, particularly the media, influences children’s, and adolescents’ body image (Watson, 2006).
es_es: Por lo tanto, el presente trabajo se centrará en investigar hasta qué punto, diversos agentes socializadores como los medios de comunicación, influyen en la imagen corporal de los niños y adolescentes (Watson,2006)..

source: These changes have been brought about by cultural evolution and industrialization, which have altered the perceptions of females regarding their bodies.
es_es: Estos cambios han sido provocados por la evolución cultural y la industrialización, que han alterado las percepciones de las mujeres con respecto a su cuerpo.

source: They discovered that most of the preadolescent girls are dissatisfied with their body proportions due to slim and beautiful women seen in media.
es_es: Descubrieron que la mayoría de las niñas preadolescentes están insatisfechas con las proporciones de su cuerpo debido a las mujeres delgadas y bellas que se ven en los medios.

source: They would easily talk to their parents concerning issues that threaten their lives but not their friends.
es_es: Hablarían fácilmente con sus padres sobre cuestiones que amenazan sus vidas, pero no con sus amigos.

source: They would lift weights in excess or even utilize drugs that would enhance muscle growth.
es_es: Levantarán peso en exceso o incluso utilizarían drogas que potenciasen el crecimiento muscular.

source: They would therefore employ weight lose strategies such as dieting, doing an exercise in excess, and using drugs such as laxatives and diuretics.
es_es: Por lo tanto, emplearán estrategias de adelgazamiento como dietas, ejercicio físico en exceso y el uso de fármacos como laxantes y diuréticos.

source: Thin and long-legged models represent the world of fashion and beauty that is so intriguing and desired for girls and women.
es_es: Las modelos delgadas y de piernas largas representan el mundo de la moda y la belleza tan intrigante y deseado por niñas y mujeres.

source: This affects the self-esteem of adolescents in many ways.
es_es: Esto afecta a la autoestima de los adolescentes de muchas maneras.

source: This again explains the importance of both parents and peers to the well-being of children.
es_es: Esto explica una vez más la importancia tanto de los padres como de los amigos para el bienestar de los niños.

source: This does not mean that the mother should be slim.
es_es: Esto no significa que la madre deba ser delgada.

source: This followed close attention to the issue of body image and body dissatisfaction.
es_es: Seguidamente, se prestó especial atención a la cuestión de la imagen corporal y la insatisfacción con el cuerpo.

source: This means that characters possessing positive behavioral traits such as kindness, success, and contentedness are frequently depicted as young, thin, and beautiful human beings.
es_es: Esto quiere decir que personas que tengan rasgos positivos de comportamiento como la amabilidad, éxito y alegría son descritos frecuentemente como seres vivos jóvenes, delgados y hermosos.

source: This means that friends influence the social life of an adolescent tremendously.
es_es: Esto significa que los amigos influyen enormemente en la vida social de un adolescente.

source: This means that peer pressure could be high in case a student resided within the campus premises.
es_es: Esto significa que la presión de los compañeros podría ser alta en caso de que un estudiante residiera dentro de las instalaciones del campus.

source: This psychological dependence on popular culture and beauty norms results in eating disorders.
es_es: Esta dependencia psicológica de la cultura popular y de las normas de belleza da lugar a trastornos alimentarios.

source: This shows that eating disorder is one of the major causes of poor body shapes among children.
es_es: Esto muestra que el trastorno alimentario es una de las principales causas de las malas formas de cuerpo en los niños.

source: This shows that the family has a big influence on the eating behaviors and feelings of children.
es_es: Esto demuestra que la familia tiene una gran influencia en los comportamientos y sentimientos alimentarios de los niños.

source: This would also have an implication on the body size of the daughter (Grogan, 2008).
es_es: Esto también repercutiría en la talla corporal de la hija (Grogan, 2008).

source: This would entail checking the physical appearance, losing weight and maintaining an attractive body shape.
es_es: Esto implicaría revisar el aspecto físico, perder peso y mantener una forma corporal atractiva.

source: This would imply that they start discussing with peers issues affecting them as opposed to discussing with their parents.
es_es: Esto implica que empiezan a hablar con sus iguales de los problemas que les afectan, en lugar de hacerlo con sus padres.

source: This would mean that girls would simply seek advice from mothers on the best drugs or practices to be employed in order to reduce body sizes.
es_es: Esto significaría que las niñas simplemente pedirían consejo a las madres sobre los mejores fármacos o prácticas a emplear para reducir las tallas corporales.

source: This would mean that there is contrary evidence reflecting children’s dissatisfaction with their bodies because of their thinness.
es_es: Esto significaría que existen pruebas contrarias que reflejan la insatisfacción de los niños con su cuerpo debido a su delgadez.

source: This would still depend on the mass media since the media suggests that certain body figures are ideal as opposed to others.
es_es: Esto sigue dependiendo de los medios de comunicación, ya que éstos sugieren que ciertas figuras corporales son ideales en contraposición a otras.

source: Those students who lived in campus were found to suffer from eating disorders since they tried to put themselves in diet in order to comply with the demands of their peers.
es_es: Se descubrió que los estudiantes que vivían en el campus sufrían trastornos alimentarios, ya que intentaban ponerse a dieta para cumplir con las exigencias de sus compañeros.

source: Those unable to control their eating practices use other dieting methods, which would perhaps result in poor health condition.
es_es: Aquellos que no pueden controlar sus prácticas alimentarias usan otros métodos de dieta, lo que quizás resulte en una mala condición de salud.

source: Though it is impossible to imagine modern life without media since television, radio, magazines, etc. have become an everyday kind of entertainment, it is essential to pay attention to the content of information provided.
es_es: Aunque es imposible imaginar la vida moderna sin los medios de comunicación, ya que la televisión, la radio, las revistas, etc. se han convertido en un entretenimiento cotidiano, es esencial prestar atención al contenido de la información proporcionada.

source: Though men are typically less obsessed by the media images and are less apt to have dissatisfaction with their bodies, their perceptions regarding their own bodies is also shaped by social factors such as media images, peer pressure, self-identity, and self-esteem (Kirk Kiss, & Burgess-Limerick, 2004).
es_es: Aunque, normalmente, los hombres están menos obsesionados por las fotos en las redes sociales y son menos propensos a tener inseguridades con sus cuerpos, sus percepciones viendo sus propios cuerpos dependen de factores sociales, como las imágenes en internet, la presión social, la propia identidad y la propia autoestima (Kirk Kiss, & Burgess-Limerick, 2004).

source: Though men’s muscular beauty is associated with thinness, some extra fat is not demonstrated as the major obstacle.
es_es: Aunque la belleza muscular de los hombres se asocia a la delgadez, no se demuestra que un poco de grasa extra sea el mayor obstáculo.

source: Though she is quite pretty and concerned with fashion trends, she seems to be unaware of her beauty while drawing male’s attention (Northup & Liebler, 2010).
es_es: Aunque es bastante guapa y le preocupan las tendencias de la moda, parece no ser consciente de su belleza mientras atrae la atención masculina (Northup & Liebler, 2010).

source: Though today’s female body image involves a muscle tone as, which reflects gender equality, slenderness has remained the key feature of the social perception of women’s physical beauty (Grogan, 1998).
es_es: Aunque la imagen actual del cuerpo femenino implica un tono muscular como, lo que refleja la igualdad de género, la delgadez ha seguido siendo la característica clave de la percepción social de la belleza física de la mujer (Grogan, 1998).

source: Through his studies and observations in this field, Bandura discovered that children imitate behaviors seen in other people.
es_es: A través de sus estudios y observaciones en este campo, Bandura descubrió que los niños imitan las conductas que ven en otras personas.

source: Through such actions, parents are known to influence the body images and eating behaviors of their children (Forbes, Adams-Curtis, Jobe, White, Revak, Zivcic-Becirevic, & Pokrajac-Bulian, 2005).
es_es: A través de estas acciones, se sabe que los padres influyen en las imágenes corporales y los comportamientos alimentarios de sus hijos (Forbes, Adams-Curtis, Jobe, White, Revak, Zivcic-Becirevic y Pokrajac-Bulian, 2005).

source: Through this concept, Bandura connects learning studies with theories of cognitive development.
es_es: A través de este concepto, Bandura conecta los estudios sobre el aprendizaje con las teorías del desarrollo cognitivo.

source: Thus, Dohnt and Tiggemann (2006) identified that 60% of 5-year-old children want their bodies to be fatter and heavier than they perceive them to be.
es_es: Así, Dohnt y Tiggemann (2006) identificaron que el 60% de los niños de 5 años desean que su cuerpo sea más gordo y pesado de lo que perciben.

source: Thus, an average model weighs 117 pounds being 5’11’’ tall while an average woman weighs 140 pounds being 5’4’’ tall.
es_es: Así pues, una modelo normalmente pesa 53kg y mide al rededor de 1,55m, mientras que la mujer promedio pesa 63kg y mide 1,64.

source: Thus, children are highly motivated to adopt and exercise some particular behaviors in life.
es_es: Así, los niños están muy motivados para adoptar y ejercer algunos comportamientos particulares en la vida.

source: Thus, children over six are able to recognize the discrepancies between their bodies and popularized standards of physical beauty (Hayes & TantIeff-Dunn, 2010).
es_es: Así, los niños mayores de seis años son capaces de reconocer las discrepancias entre sus cuerpos y los cánones popularizados de belleza física (Hayes & TantIeff-Dunn, 2010).

source: Thus, girls reading fashion magazines are seven times more vulnerable to exercise a variety of unhealthy weight control behaviors and six times are more likely to involve in extreme practices on weight control in contrast to girls not interested in fashion readings (Lopez-Guimera, Levine, Sanchez-Carracedo, & Fauquet, 2010).
es_es: Así, las niñas que leen revistas de moda son siete veces más vulnerables a ejercer una serie de conductas de control de peso poco saludables y seis veces más propensas a involucrarse en prácticas extremas de control de peso en contraste con las niñas no interesadas en las lecturas de moda (López-Guimera, Levine, Sánchez-Carracedo, & Fauquet, 2010).

source: Thus, in contrast to earlier trends, modern media illustrate women and girls as self-confident, intelligent, and assertive human beings (Banet-Weiser, 2004).
es_es: Así, en contraste con tendencias anteriores, los medios de comunicación modernos ilustran a las mujeres y las niñas como seres humanos seguros de sí mismos, inteligentes y asertivos (Banet-Weiser, 2004).

source: Thus, it is considerable to discuss these three media types in detail.
es_es: Por lo tanto, es importante discutir estos tres tipos de medios en detalle.

source: Thus, it is essential to discuss its concept in detail to clarify factors contributing to children’s sense of self-efficacy and encouraging them to perform some kinds of conduct.
es_es: Por lo tanto, es esencial discutir su concepto en detalle para aclarar los factores que contribuyen al sentido de autoeficacia de los niños y les animan a realizar algunos tipos de conducta.

source: Thus, media influence children’s perception of different life concepts not only through eyesight, but also through mental states.
es_es: Así, los medios influyen en la percepción que tienen los niños de distintos conceptos vitales no solo a través de la vista, sino también de los estados mentales.

source: Thus, media production introducing a standard of male physical attractiveness emphasizes muscles development as a symbol of strength and health.
es_es: Así, la producción mediática que introduce un estándar de atractivo físico masculino hace hincapié en el desarrollo de los músculos como símbolo de fuerza y salud.

source: Thus, men are reported to see slenderness and muscularity as symbols of fitness, and believe that this shape of men’s bodies is strongly associated with being in control of one’s own eating and lifestyle habits (Grogan, 2008).
es_es: De este modo, a los hombres se les ha reflejado que la delgadez y la musculatura son símbolos de estar sano, y creen que este tipo de cuerpos masculinos son más fuertes, asociado con controlar lo que come uno mismo y los hábitos de vida saludables (Grogan, 2008).

source: Thus, such mental states as satisfactions, pride, or sense of accomplishment produce a considerable impact on the learning process.
es_es: Así, estados mentales como la satisfacción, el orgullo o la sensación de logro producen un impacto considerable en el proceso de aprendizaje.

source: Thus, the consequences of media influence on children’s body perception, especially girls, are quite negative and require appropriate actions from society that has created this tendency of physical attractiveness obsession and ideal of thinness.
es_es: Por lo tanto, las consecuencias de la influencia de los medios de comunicación en la percepción del cuerpo de los niños, especialmente de las niñas, son bastante negativas y requieren acciones apropiadas por parte de la sociedad que ha creado esta tendencia de obsesión por el atractivo físico y el ideal de delgadez.

source: Thus, the contemporary media identify positive behavioral traits with pretty appearances and slim bodies (Seon-Kyoung, & Doohwang, 2010).
es_es: Así, los medios de comunicación contemporáneos identifican rasgos positivos de comportamiento, las apariencias bonitas y de cuerpos delgados (Seon-Kyoung, & Doohwang, 2010).

source: Thus, the influence of the beauty culture on girls’ mentality and psychology is evident.
es_es: Así, la influencia de la cultura de la belleza en la mentalidad y psicología de las niñas es evidente.

source: Thus, the researchers showed that today 50% of girls under 15 start dieting (Champion & Furnham, 1999).
es_es: Así, los investigadores demostraron que hoy en día el 50% de las niñas menores de 15 años empiezan a hacer dieta (Champion & Furnham, 1999).

source: Thus, thin body types promoted by the contemporary fashion magazines and other resources (Grogan, 1998), replaced ample curves of women in the middle Ages.
es_es: Así, los tipos de cuerpo delgado promovidos por las revistas de moda contemporáneas y otros recursos (Grogan, 1998), sustituyeron a las amplias curvas de las mujeres de la Edad Media.

source: Thus, video media resources produce a significant impact on girls’ social life and the development of their sexual identity (Monnot, 2010).
es_es: Así pues, los medios que incluye videos, producen un impacto significativo en la vida social de las chicas y en el desarrollo de su identidad sexual (Monnot, 2010).

source: To contrast, the US Center for Disease Control revealed that the majority of American states except few have obesity prevalence among children over 25% (Bissell, & Hays, 2011).
es_es: En contraste, el Centro de Control de Enfermedades de EE.UU. reveló que la mayoría de los estados norteamericanos, excepto unos pocos, tienen una prevalencia de obesidad infantil superior al 25% (Bissell, & Hays, 2011).

source: Today, slimness is associated not only with physical beauty, but it has become a symbol of self-control, youthfulness, elegance, success, and social attractiveness.
es_es: Hoy en día, la delgadez se asocia no solo con la belleza física, sino que se ha convertido en un símbolo de autocontrol, juventud, elegancia, éxito y atractivo social.

source: Today, the topic of the body issue is not only adopted by medical, social, or psychological journals but is also intensely discussed by a variety of adolescent-oriented magazines and other information sources (Markey, & Markey, 2010).
es_es: Hoy en día, el tema de la cuestión corporal no solo se adopta en revistas médicas, sociales o psicológicas, sino que también se debate intensamente en diversas revistas orientadas a los adolescentes y otras fuentes de información (Markey, & Markey, 2010).

source: Trendy female character is a person obsessed with her appearance, boys’ perception and attention, and clothes.
es_es: La femenina de moda es una persona obsesionada con su aspecto, la percepción y atención de los chicos y la ropa.

source: Unreal standards of body beauty promoted by media and social culture are impossible for girls to achieve.
es_es: Los estándares irreales de belleza corporal promovidos por los medios de comunicación y la cultura social son imposibles de alcanzar para las chicas.

source: Verbal and non-verbal messages received by daughters from their mothers influence their body images.
es_es: Los mensajes verbales y no verbales que reciben las hijas de sus madres influyen en su imagen corporal.

source: Video games are a kind of entertainment exercised by children in a regular manner.
es_es: Los videojuegos son un tipo de entretenimiento ejercido por los niños de forma habitual.

source: Video games provoke a sense of self-identification with children encouraging their imitation behaviors.
es_es: Los videojuegos provocan en los niños un sentimiento de identificación que fomenta sus conductas de imitación.

source: When the information is acquired and preserved, it is time to put into practice the performance of the acquired action.
es_es: Una vez adquirida y conservada la información, llega el momento de poner en práctica la acción adquirida.

source: While babies and young children engage in pretend plays through adopting the character role, older children focus on social comparisons with characters they adore.
es_es: Mientras que los bebés y los niños pequeños participan en juegos de simulación adoptando el papel del personaje, los niños mayores se centran en las comparaciones sociales con los personajes que adoran.

source: While fashion model become thinner, females are considered getting heavier.
es_es: Mientras que las modelos se vuelven más delgadas, se considera que las mujeres se están volviendo más gordas.

source: While the family would only urge children to adopt certain diets, the media would influence children to believe that certain body figures are superior to others.
es_es: Mientras que la familia sólo instaría a los niños a adoptar determinadas dietas, los medios de comunicación influirían en los niños para que creyeran que determinadas figuras corporales son superiores a otras.

source: Youths would frequently relate to friends more as compared to their parents, which would further affect their capabilities in social circumstances.
es_es: Con frecuencia, los jóvenes se relacionan más con sus amigos que con sus padres, lo que afecta aún más a sus capacidades en circunstancias sociales.

source: en-US
es_es: 4en-US

source: tailored to your instructions
es_es: adaptado a sus instrucciones
